app/Models/ComposerModel.php

SELECT *
FROM `tb_composer`
SELECT *
FROM `tb_composer`
WHERE `ID_COMPOSER` = 'KCP-CPS-1'
---
    public function getAll($id = false)
    {
        if ($id == false) {
            return $this->findAll();
        }

        return $this->where(['ID_COMPOSER' => $id])->find();