app/Models/ContractModel.php

SELECT *
FROM `tb_contract`
---
    public function getAll($id = false)
    {
        if ($id == false) {
            return $this->findAll();