app/Models/CustomerModel.php

    public function getAll($id = false)
    {
        if ($id == false) {
            return $this->findAll();
---
SELECT *
FROM `tb_customer`