app/Models/TelephoneModel.php

SELECT *
FROM `tb_telephone`
WHERE `ID_TELEPHONE` = 'KCP-CPS-1'
---
    public function getAll($id = false)
    {
        if ($id == false) {
            return $this->findAll();
        }

        return $this->where(['ID_TELEPHONE' => $id])->find();